/** 常用变量 */
const CConst = {

    javaClassName: 'org/cocos2dx/javascript/AppActivity',

    /*****************************************************************************************/
    /*************************************** bundle ****************************************/
    /*****************************************************************************************/
    bundleCommon: 'components',
    bundleGame: 'game',
    /*************************************** end **************************************************/


    /*****************************************************************************************/
    /*************************************** 层级 ****************************************/
    /*****************************************************************************************/
    zIndex_menu: 1,
    zIndex_game: 2,
    zIndex_gameWin: 997,
    zIndex_newPlayer: 998,
    zIndex_loading: 999,
    zIndex_mask: 1000,
    zIndex_video: 1001,
    zIndex_popup: 1002,
    zIndex_noVideo: 1002,
    /*************************************** end **************************************************/


    /*****************************************************************************************/
    /*************************************** 事件 ****************************************/
    /*****************************************************************************************/
    /** loading完成 */
    event_complete_loading: 'event_complete_loading',
    /** 进入 菜单 */
    event_enter_mainMenu: 'event_enter_mainMenu',
    /** 进入 新手引导 */
    event_enter_newPlayer: 'event_enter_newPlayer',
    /** 进入 游戏sort */
    event_enter_gameSort: 'event_enter_gameSort',
    /** 进入 胜利 */
    event_enter_gameWin: 'event_enter_gameWin',
    /** 进入 下一关游戏 */
    event_enter_nextLevel: 'event_enter_nextLevel',
    /** 提示：没有视频 */
    event_tip_noVideo: 'event_tip_noVideo',
    /** 提示：没有网络 */
    event_tip_noNetwork: 'event_tip_noNetwork',
    /*************************************** end **************************************************/


    /*****************************************************************************************/
    /*************************************** 打点 ****************************************/
    /*****************************************************************************************/
    /** 打点：点击分享 */
    event_log_share_click: 'share_level_click',
    /** 打点：点击看广告奖励金币 */
    event_log_adAddCoin_click: 'Ads_addCoin_click',
    /** 打点：点击转盘 */
    event_log_wheel_click: 'wheel_click',
    /*************************************** end **************************************************/

    /*****************************************************************************************/
    /*************************************** 弹窗地址 ****************************************/
    /*****************************************************************************************/
    popup_path_setting: './Popup/Setting/res/prefab/Setting',
    popup_path_special_tip: './Popup/SpecialTip/res/prefab/SpecialTip',
    popup_path_special_quit: './Popup/SpecialQuit/res/prefab/SpecialQuit',
    popup_path_user_evaluate: './Popup/UserEvaluate/res/prefab/UserEvaluate',
    /*************************************** end **************************************************/


    /*****************************************************************************************/
    /*************************************** 音频资源地址 ****************************************/
    /*****************************************************************************************/
    /** 音效：按键 */
    sound_path_music: './audio/music',
    sound_path_click: './audio/click',
    sound_path_reward: './audio/reward',
    sound_path_win: './audio/win',
    sound_path_finish: './audio/finish',
    sound_path_ballSort: './audio/ballSort',
    sound_path_ballLong: './audio/ballLong',
    /*************************************** end **************************************************/


    /*****************************************************************************************/
    /*************************************** 新手引导 ****************************************/
    /*****************************************************************************************/
    /** sort游戏 引导 1 */
    newPlayer_guide_sort_1: 'newPlayer_guide_sort_1',
    /** sort游戏 引导 2 */
    newPlayer_guide_sort_2: 'newPlayer_guide_sort_2',
    /** sort游戏 引导 3 */
    newPlayer_guide_sort_3: 'newPlayer_guide_sort_3',
    /*************************************** end **************************************************/
};
export default CConst;